Thenewmanator15/esp32c6-sniffer/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Console on UART0 (GPIO16, header pin D6). The SECONDARY setting is critical:
# the ESP-IDF default also mirrors console output onto USB-Serial-JTAG, which
# would inject log text into the framed data stream.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Light sleep gates the USB PHY clock and kills the link.
CONFIG_PM_ENABLE=n

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000

# IEEE 802.15.4 capture.
# More receive buffers than the default 20, so a burst is not lost while the
# USB task drains. Each costs about 128 bytes.
CONFIG_IEEE802154_RX_BUFFER_SIZE=50
# The driver's "Rx buffer full" warning is compiled out unless this is set,
# which makes overflow completely invisible in a default build.
CONFIG_IEEE802154_DEBUG=y
